Repository: SyedaNadia/gold-price-chart-widget
Catalog: languages/gold-price-widget-*.po
Languages: it_it

source: Gold Price by
it_it: Quotazione dell'oro da

source: https://www.goldbroker.com
it_it: https://www.goldbroker.it

source: Goldbroker.com
it_it: Goldbroker.it

source: Gold Price
it_it: Quotazione dell'oro

source: Title
it_it: Titolo

source: Select currency
it_it: Valuta

source: Height
it_it: Altezza

source: Width
it_it: Larghezza

source: Silver Price by
it_it: Quotazione dell'argento da

source: Silver Price
it_it: Quotazione dell'argento
